CREATE DATABASE [Restaurants]
ON PRIMARY
(NAME = N'Restaurants', FILENAME = N'C:\Program Files\Microsoft SQL Server\MSSQL11.IVANSERVER\MSSQL\DATA\Rastaurants.mdf', 
	SIZE = 51200KB, FILEGROWTH = 10240KB)
LOG ON
(NAME = N'Restaurants_log', FILENAME = N'C:\Program Files\Microsoft SQL Server\MSSQL11.IVANSERVER\MSSQL\DATA\Rastaurants_log.ldf',
	SIZE = 10240KB, FILEGROWTH = 10%)
COLLATE Cyrillic_General_100_CI_AI
GO
ALTER DATABASE [Restaurants] SET RECOVERY SIMPLE WITH NO_WAIT;
GO
ALTER DATABASE [Restaurants] SET AUTO_SHRINK OFF;
GO

CREATE TABLE dimDate
(
ID_Date bigint NOT NULL PRIMARY KEY,
[Year] int NOT NULL,
[Month] int NOT NULL,
[Day] int NOT NULL,
) ON [FastGrowingFG]

CREATE TABLE dimLocation
(
ID_Location bigint NOT NULL PRIMARY KEY,
City_Name varchar(50),
Region_Code int,
Region_Name varchar(100),
Country_Code int,
Country_Name varchar(100)
) ON [Read-OnlyFG]

CREATE TABLE dimClientCategory
(
ID_ClientCategory int NOT NULL IDENTITY(1, 1) PRIMARY KEY,
Age int NOT NULL,
Sex varchar(30) NOT NULL,
Earnings int NOT NULL,
Martial_Status varchar(50) NOT NULL,
Children_Count int NOT NULL
) ON [Read-OnlyFG]

CREATE TABLE dimClient
(
ID_Client bigint NOT NULL IDENTITY(1, 1) PRIMARY KEY,
ID_Location bigint FOREIGN KEY REFERENCES dimLocation(ID_Location),
ID_ClientCategory int FOREIGN KEY REFERENCES dimClientCategory(ID_ClientCategory),
FIO varchar(150),
Register_Date date,
MoneySpent int,
Purchases_Count int,
Adress varchar(150),
Birthday date,
Sex varchar,
ID_DataBase int NOT NULL,
Actual bit NOT NULL
) ON [FastGrowingFG]

CREATE TABLE dimRecipe
(
ID_Recipe int NOT NULL PRIMARY KEY,
Recipe_Name varchar(100),
Calories int,
Recipe_Category varchar(100)
) ON [FrequentlyUsedFG]

CREATE TABLE dimOffice
(
ID_Office int NOT NULL IDENTITY(1, 1) PRIMARY KEY,
ID_Location bigint FOREIGN KEY REFERENCES dimLocation(ID_Location),
Office_Name varchar(50),
Phone varchar(30),
Adress varchar(150),
ID_DataBase int NOT NULL, 
Actual bit NOT NULL
) ON [FrequentlyUsedFG]

CREATE TABLE dimCook
(
ID_Cook int NOT NULL IDENTITY(1,1) PRIMARY KEY,
ID_Office int FOREIGN KEY REFERENCES dimOffice(ID_Office),
Hire_Date date,
Dismissal_Date date,
FIO varchar(80),
Post varchar(100),
Sex varchar(30),
ID_DataBase int NOT NULL,
Actual bit NOT NULL
) ON [SlowGrowingFG]

/* INDEXES */
/*
CREATE NONCLUSTERED INDEX nciCookBK ON dimCook (ID_DataBase) INCLUDE (ID_Cook, ID_Office, Post)
CREATE NONCLUSTERED INDEX nciClientBK on dimClient (ID_DataBase) INCLUDE (ID_Client, Adress)
CREATE NONCLUSTERED COLUMNSTORE INDEX FP_ColumnIndex ON FastPurchases (ID_Date, ID_Recipe, ID_Cheque)
CREATE NONCLUSTERED INDEX nciOfficeFP on FastPurchases (ID_Office) INCLUDE (ID_Cheque, ID_Recipe)
CREATE NONCLUSTERED INDEX nciOfficeFP on FastPurchasesArch (ID_Office) INCLUDE (ID_Cheque, ID_Recipe)
GO
*/
--Sectioining
CREATE PARTITION FUNCTION PFFastPurchases_Date (bigint)
AS RANGE RIGHT FOR VALUES (20130101, 20140101, 20150101, 20160101)
GO

CREATE PARTITION SCHEME PSFastPurchases_Date AS PARTITION PFFastPurchases_Date TO
(
	[FrequentlyUsedFG],
	[FrequentlyUsedFG],
	[FrequentlyUsedFG],
	[FrequentlyUsedFG],
	[FrequentlyUsedFG]
)
GO

CREATE PARTITION FUNCTION PFFastPurchasesArch (bigint)
AS RANGE RIGHT FOR VALUES (20130101)
GO

CREATE PARTITION SCHEME PSFastPurchasesArch AS PARTITION PFFastPurchasesArch TO
(
	[FastGrowingFG],
	[FrequentlyUsedFG]
)
GO

CREATE TABLE FastPurchases
(
ID_Cheque int NOT NULL,
ID_Location bigint NOT NULL FOREIGN KEY REFERENCES dimLocation(ID_Location),
ID_Office int NOT NULL FOREIGN KEY REFERENCES dimOffice(ID_Office),
ID_Client bigint NOT NULL FOREIGN KEY REFERENCES dimClient(ID_Client),
Price int NOT NULL,
ID_Cook int NOT NULL FOREIGN KEY REFERENCES dimCook(ID_Cook),
ID_Recipe int NOT NULL FOREIGN KEY REFERENCES dimRecipe(ID_Recipe),
ID_Date bigint NOT NULL FOREIGN KEY REFERENCES dimDate(ID_Date),
ID_ClientCategory int NOT NULL FOREIGN KEY REFERENCES dimClientCategory(ID_ClientCategory),
Quantity int NOT NULL
CONSTRAINT PK_FP PRIMARY KEY (ID_Cheque, ID_Recipe, ID_Date)
) ON PSFastPurchases_Date (ID_Date)
GO

CREATE TABLE FastPurchasesArch
(
ID_Cheque int NOT NULL,
ID_Location bigint NOT NULL FOREIGN KEY REFERENCES dimLocation(ID_Location),
ID_Office int NOT NULL FOREIGN KEY REFERENCES dimOffice(ID_Office),
ID_Client bigint NOT NULL FOREIGN KEY REFERENCES dimClient(ID_Client),
Price int NOT NULL,
ID_Cook int NOT NULL FOREIGN KEY REFERENCES dimCook(ID_Cook),
ID_Recipe int NOT NULL FOREIGN KEY REFERENCES dimRecipe(ID_Recipe),
ID_Date bigint NOT NULL FOREIGN KEY REFERENCES dimDate(ID_Date),
ID_ClientCategory int NOT NULL FOREIGN KEY REFERENCES dimClientCategory(ID_ClientCategory),
Quantity int NOT NULL
CONSTRAINT PK_FP_Arch PRIMARY KEY (ID_Cheque, ID_Recipe, ID_Date)
) ON PSFastPurchasesArch (ID_Date)
GO

CREATE TABLE FastPurchasesTemp
(
ID_Cheque int NOT NULL,
ID_Location bigint NOT NULL,
ID_Office int NOT NULL,
ID_Client bigint NOT NULL,
Price int NOT NULL,
ID_Cook int NOT NULL,
ID_Recipe int NOT NULL,
ID_Date bigint NOT NULL,
ID_ClientCategory int NOT NULL,
Quantity int NOT NULL
) ON [FastGrowingFG]
GO

CREATE PROCEDURE SW
AS
	-- STEP 1
	DECLARE @DateForPartFP varchar(8);
	DECLARE @DateForArch varchar(8);

	SET @DateForPartFP = CAST((SELECT TOP 1 [value] FROM sys.partition_range_values 
		WHERE function_id = (SELECT function_id FROM sys.partition_functions WHERE name = 'PFFastPurchases_Date')
		ORDER BY boundary_id DESC) AS varchar(8));

	SET @DateForArch = CAST((SELECT TOP 1 [value] FROM sys.partition_range_values 
		WHERE function_id = (SELECT function_id FROM sys.partition_functions WHERE name = 'PFFastPurchases_Date')
		ORDER BY boundary_id ASC) AS varchar(8));

	DECLARE @Date_1 DATE;
	SET @Date_1 = DATEADD(YEAR, 1, CAST(@DateForPartFP as DATE)); --2017
	DECLARE @Date_2 DATE;
	SET @Date_2 = DATEADD(YEAR, 1, CAST(@DateForArch as DATE));   --2014

	ALTER PARTITION SCHEME PSFastPurchases_Date NEXT USED [FrequentlyUsedFG];
	ALTER PARTITION SCHEME PSFastPurchasesArch NEXT USED [FrequentlyUsedFG];

	ALTER PARTITION FUNCTION PFFastPurchases_Date() SPLIT RANGE (CAST(CONVERT (varchar(8), @Date_1, 112) as bigint));
	ALTER PARTITION FUNCTION PFFastPurchasesArch() SPLIT RANGE (CAST(CONVERT (varchar(8), @Date_2, 112) as bigint));
	-- STEP 2
	DECLARE @last_section_number int;
	SET @last_section_number = (SELECT TOP 1 [partition_number] FROM sys.partitions WHERE OBJECT_ID = 
		(SELECT OBJECT_ID FROM Sys.tables WHERE name = 'FastPurchasesArch') ORDER BY [partition_number] DESC) - 1;

	ALTER TABLE FastPurchases SWITCH PARTITION 2 TO FastPurchasesArch PARTITION @last_section_number;
	-- STEP 3
	DECLARE @Date_First bigint;
	DECLARE @Date_FirstArch bigint;

	SET @Date_First = CAST((SELECT TOP 1 [value] FROM sys.partition_range_values 
		WHERE function_id = (SELECT function_id FROM sys.partition_functions WHERE name = 'PFFastPurchases_Date')
		ORDER BY boundary_id ASC) as bigint);

	ALTER PARTITION FUNCTION PFFastPurchases_Date() MERGE RANGE (@Date_First);
	-- STEP 4
	SET @DateForArch = CAST((SELECT TOP 1 [value] FROM sys.partition_range_values 
		WHERE function_id = (SELECT function_id FROM sys.partition_functions WHERE name = 'PFFastPurchasesArch')
		ORDER BY boundary_id DESC) AS varchar(8));
	SET @Date_2 = DATEADD(YEAR, -1, CAST(@DateForArch as DATE));
	PRINT CONVERT (varchar(8), @Date_2, 112);
	ALTER PARTITION FUNCTION PFFastPurchasesArch() MERGE RANGE (CAST(CONVERT (varchar(8), @Date_2, 112) as bigint));
	ALTER PARTITION SCHEME PSFastPurchasesArch NEXT USED [FastGrowingFG];
	ALTER PARTITION FUNCTION PFFastPurchasesArch() SPLIT RANGE (CAST(CONVERT (varchar(8), @Date_2, 112) as bigint));
	-- STEP 5
GO

INSERT INTO dimClientCategory VALUES
(15, 'ל', 5000, 'q', 1),
(20, 'ל', 5000, 'q', 1),
(25, 'ל', 5000, 'q', 1),
(30, 'ל', 5000, 'q', 1),
(35, 'ל', 5000, 'q', 1),
(40, 'ל', 5000, 'q', 1),
(45, 'ל', 5000, 'q', 1),
(55, 'ל', 5000, 'q', 1),
(60, 'ל', 5000, 'q', 1),
(65, 'ל', 5000, 'q', 1),
(70, 'ל', 5000, 'q', 1)
GO

INSERT INTO dimLocation VALUES
(0,'ד‏הבלצמענ',55,'ûיכףזûüחל',23,'‏םüזקח‏ףעם'),
(1,'דûכזÿדת‎ירו',13,'כüצץוûףםיךüûמע',86,'מארצ‎עיעצ‏‎י'),
(2,'םןפעהאזנכ',84,'עûבגצגס‎בכÿתנך',76,'ע‎ילא‏ושץי'),
(3,'עךילףÿחצÿ',20,'םüמזדןקיבÿיןב',99,'‎üצעעז‎נהןךקגקט'),
(4,'לףכיע‏ףפ‏',06,'פÿפהש‏ץןעגפ',87,'נםטףןץזש‎ך'),
(5,'אקכרבחהמÿנאפבם',25,'ץחûףגÿרנעתהפ',81,'‏יץרזךהצףמשצ'),
(6,'חטפקךךנקטצתצ',53,'מהטש‏עûודוüפוףר',00,'ץואש‎קחךשצםנ'),
(7,'יםטפיךשוטבאפ',55,'וסטבלציכחקל',79,'‎תץבûבא‏יטתחז'),
(8,'ץפÿתחשדסץנ',82,'שלבז‏מבנü‏שסÿג',36,'ûפחורךזייגש'),
(9,'צרגדסזÿתים‏גאצ',42,'שזÿי‏סםמד',82,'‏א‎כגדÿבח'),
(10,'ןפווûטביו',12,'זצטüףטם‏‏עכסÿ',06,'ץזל‏חרףםנ‏'),
(11,'‏ûגזבכלתנ',92,'חפזעץךûטףכזüץך‏',57,'ךבû‎רןטצעûפשם'),
(12,'םנהתפזזףףככב',00,'לדלףזופסמךםןץנך',93,'‎פםפשחשגü'),
(13,'ברםלחאדהרזחץלנת',76,'שח‎סא‏סאםטביחב',95,'הרÿץגאז‏לסבהףןף'),
(14,'ףףאדךן‏ךןץןףבץ',06,'וחךצחםב‏וזפיאיע',81,'םבןקצזû‎ט'),
(15,'רכטברבכטעגשפנ',59,'טרםעי‎זישעûפ',48,'קרץנץקץÿא'),
(16,'םםפשכדוסטוצ',17,'כץראבאןמü',74,'גךךןחüקוחךûעû'),
(17,'אהזדסחנךנמץןדן‏',87,'נûטבדיטךצי‏',95,'טסלםה‏‏בדלרנÿ'),
(18,'דםןקחנשÿ‎üחד',83,'יÿשיפמאüו‏גרג',09,'צפלûרןףגס‏'),
(19,'‎רהףÿב‏נכצצ',15,'שץררכלמכש',26,'נךמ‎םפסעפןםץ'),
(20,'נץ‏ךאüאצג',55,'צסבû‎תךע‏גם',36,'ר‏שמןתÿנפפ'),
(21,'ץוüנרזתעûבא',36,'‎צייפגץעלת',31,'זדאûדףשץטטםבךץע'),
(22,'‎ךותüיק‎כץיות',01,'םקכחתÿהטעגץזהזü',51,'דןצךבפיפהסבר'),
(23,'מûףüאךאן‎צ',13,'יקטשלםךזםץ',60,'שכרקרםץתאüמתÿב'),
(24,'üצומבנ‎ÿמסהויעח',16,'זגדףשפנזעשפ',60,'לא‏בפרדנכ'),
(25,'קצעטףüץק‏קמעûעז',62,'‏צתרםץקעךק',80,'טמÿנאתüûÿתÿ'),
(26,'‎תשהûאזב‎',89,'üרכךקדרשך',86,'גהס‏ןדדבû'),
(27,'נעתירוגסüו',90,'‏‎ם‏שנב‏יפתה',19,'ישפסÿרעטטסם'),
(28,'ולגפעלפינצדן',11,'ד‎‎ברתןסרמ‎ך',90,'וויהנ‏ןüג‏צ'),
(29,'כ‏אצןחהךפצÿלת',21,'כי‎וףךמקעס',22,'פרגןרÿפחןגפמ'),
(30,'‏שצזלחüûפü‏ק‎כמ',16,'הף‏גרהחצנג‎הצ',79,'מ‎לüחהחüןעÿיל'),
(31,'ףניהס‏םכב',10,'ÿגץרמ‎ייכס',34,'למותשץך‏ü'),
(32,'מק‎קףףיקךמצעצ',70,'ףעםהקזצגר',84,'מןףבתשי‏זזךו'),
(33,'פחצבכ‎כגךשטעא',82,'אמחגן‎המאטילגנ',27,'ÿטאיכבÿש‎ההרף'),
(34,'תשדאמזבקפ',81,'לןד‎דגהסüףרתני',59,'ץקנתםךדû‎י'),
(35,'פשגלמצךקגש',99,'נלאÿאםחךÿפךתד',91,'תûכפüלץת‎מüה'),
(36,'רחטטמרףטט‎מ‏סגב',38,'ץחאü‏גכגשמקסס',58,'ידטםץטüכיתרÿקץ'),
(37,'üףךא‏שץוüען',92,'ודקויאהלחן',62,'ןךהבששסםגצמüדכ'),
(38,'ךקסמוויזגÿטאן',22,'יÿכסןסךקקנמהÿ',92,'זÿלמüובפקםÿתח'),
(39,'תנםניוחכפמןנמד',84,'ךככרשנכטצ',80,'בקקûפםיםיעמב'),
(40,'ÿכ‏ףשהב‎אה',17,'ÿופנץט‎חת‎צע',86,'צהשלמיה‎אבע'),
(41,'ןעהנעטבצזÿיצÿה',01,'קו‏üףדדהעכטדךÿנ',18,'םסןהוצר‏ץט‏ב'),
(42,'לûיÿםוטכיםש‎ךח',53,'לקץםüץטךטן',30,'פדסטףנןאנכודקד'),
(43,'אןםגטףננק‎ח',89,'גטבטןתוךרלםגלאü',68,'üגתושנחאטדכתםהב'),
(44,'ûהבסüרÿךףזץ',22,'גטועעךחקבחקנûח',51,'יהסב‎ףגםף'),
(45,'זמפק‎לנבז‎קת',76,'כלÿצלזקשוצקוףעכ',62,'ÿüיטחדשזגץשב'),
(46,'קם‏ÿסזש‎ךז',42,'הנבדעפסד‎לûכץ',31,'םץעןומהÿחקבגן'),
(47,'טממדץתנעכעüןס',84,'תוÿעך‏ûוץט',09,'כחיס‏רפסתנלץ'),
(48,'משנצרד‏חץא',49,'כûפ‎צבלקבסכלכü',13,'רהûףאךןזüשקיג'),
(49,'אח‎כגחםםחשן‎נןÿ',98,'ûקכויעך‏üו',98,'ÿÿגדץמדצץÿ'),
(50,'ף‎םטאךךחזעוצפ',95,'חעדזטצüדץûיףומח',72,'כÿךדאûגüעןט‎כךד'),
(51,'üכחלÿףüדתÿאÿח',35,'סüגמבסץ‎תקמסג',11,'גיתחנתÿצכ'),
(52,'ענזÿקריזע',98,'ך‎וקםשüיפמ‎',53,'צÿז‎גיאךםעהüשז'),
(53,'ûאוזדûקם‏',83,'ןץףתנûךת‏טקפ',10,'אפךהקלמףףשד‏צזü'),
(54,'משסמרםוהגדובץ',29,'ףךהח‎נזהרחחפס',00,'ÿפûדטס‎ץזעב'),
(55,'כץגמדוןקתם',03,'ףםדוגכ‎סטששףגך',15,'דחÿÿרףתלע‎'),
(56,'םפלכז‏נתחסצן‎פ',16,'צתהףץףרר‏יÿי',61,'קשפיטבושןךף‏'),
(57,'ףך‎נחÿםף‎û‏יüקû',31,'םעיÿאבאךיהÿü',27,'ץךûזתףÿהחתûת'),
(58,'ץגבבקטךפק',69,'עלרתפףבגףץû',35,'ע‏ףץא‏ץמרםאא'),
(59,'üצשמד‎סüץך‎ÿרÿ',34,'ףרמיס‏צזהןנקסגב',83,'םזסתץפףןגÿקףחג'),
(60,'ץגן‎אדזטםנז',72,'דםםזשצמיאצ',98,'גחםחה‎פש‏גנח'),
(61,'נבדיהאףץעד',87,'בבûנקדטייכןרםןü',23,'ץאכצאפעץו‏ךמץüו'),
(62,'כםרנסבהץחןץר',40,'כםוצז‏מזע',14,'א‏וüÿםפ‏מזרדמע'),
(63,'ףüנרז‏ûחךüכ',48,'‏ךתברתנםילסומפס',22,'סהקךדסחןמÿ'),
(64,'בפûקûעתלדח',41,'ש‏ס‏ץלחהץרתהחם',61,'רפי‎קשףפףבטךןנ'),
(65,'‏ברÿצבÿצט',11,'ûתûםימÿüטמכ',62,'אסבףכךחץך‎‎ה'),
(66,'לעגשנחÿעףנך',40,'חץרתגןחפדב',07,'נגע‎צלûטה'),
(67,'עוטÿטפלÿהכÿץם',15,'ךטשûטענפ‎צ',34,'תם‎זףהקרף‎ÿוגעש'),
(68,'נדץםךûבנכפ‎וץ‎',39,'ûקיעמויןצך',71,'םü‏קÿדנןס‎'),
(69,'דהפגכא‏בצךה',91,'הע‏חףחסקחüüפץג',03,'שזננזצ‎עו'),
(70,'üÿבםאמב‎‏',91,'אצעת‏כיןךו',30,'גיוםםצץקגבף‎'),
(71,'חüציצנסןחשהלם',03,'מוüסעארצשט',32,'זןקךבשדבונûד'),
(72,'םגץרטאןעכחינ',27,'יה‏üנ‏העקמח',57,'גן‎דףךא‎‎'),
(73,'סאכרûÿצüÿ',10,'רעגטד‎üט‏üכףנ',78,'ךךמוםדההככüךע'),
(74,'תשחףשפןמכףפש',84,'ףיתÿש‎ךכüûרט',33,'כםüüדיס‎גךüרש'),
(75,'חבד‎‎הזסנב',50,'תש‎üינאצר',21,'כהקקבקטיûףףמûחת'),
(76,'סעסגעזעחכלףןפט',35,'‏‏דףץךמםü‎גחךü',73,'üדיקûרקהמנשÿתםש'),
(77,'טךשüף‏‏זדגןרÿ',87,'‏בחץ‏ררגשבמוץ',49,'ûעשףכאקשםצüרכם'),
(78,'ם‎וףחוןףםüךüגלל',43,'הûגת‎א‏דזץףטנףח',91,'ץצוףםאףכüיסאמא'),
(79,'טסט‏אüמשדנ‏',49,'צÿקטûב‏ככדג‎',38,'פגוטי‎טאûפ'),
(80,'מקץ‎םצאהÿחûם',28,'דךםעםמגםוגסבז',12,'ל‎נץקנתחנץת‎ן'),
(81,'‏תûךעםפיÿכ',80,'üÿ‏‏ץûרהח‎ם',89,'גיכנפהםףכצ'),
(82,'לעףדיזעקת',29,'מטתסרלוסרמ‎ל',17,'יףץאüüנח‎‏א'),
(83,'ראתזזלץתüספ',97,'א‎טמתןץדןש',16,'גבץפץישנהסÿ'),
(84,'םסםמüףקבעחûע',30,'בטÿטמלקץכ',44,'ץףטםהתקקבס'),
(85,'ררדסטמנüספץהף‎ם',36,'רקהעüףÿקיץצצבם',86,'מûץרטאנטצקב'),
(86,'שפאעוומזש‎זדץספ',79,'ךשחüנוהÿüך‏ü',52,'גן‎בשעשהמשן‏סהף'),
(87,'üץןגץחארץבגג',45,'דתאאץטו‎ûüשץר‏ם',58,'צבטםבנללז'),
(88,'כטאüלדüדטת',43,'םמ‎ךארףךבצקג',51,'טךפץגÿכךצזךןג'),
(89,'תתמךÿנ‏ÿם',26,'‎תצראספרףאםקףאך',29,'כחלדשûץץûג'),
(90,'אם‎עסמüץסר‏ךבצ',25,'סûÿÿכסמüנטקץיףף',13,'‏הנÿםז‎דגבדך'),
(91,'אסüץףך‏חן',74,'קסרפתטסטüזטסשי',58,'‏פמüפצ‎ננצ'),
(92,'הדץגדששÿחףפשאק',44,'ומעûמא‎‏בף',21,'באבמותבךאûבû'),
(93,'ררךנüצתדüזûפס',04,'זגעזננזס‏תלפסםך',02,'י‏עסןרזןלש'),
(94,'שרסצט‎ןקש',93,'ץטüיץח‏דוûע',67,'ץר‏כצךגףדשצ'),
(95,'ג‏גשüםתהבך',44,'‏כטצךזרבûû',55,'ערקקפסטםץו'),
(96,'חעךכ‎קכרטהרנûס‎',19,'נüשסןפקכךיכת',47,'האגיבגץטתףינסב'),
(97,'ףבחץבחאדבגגל',49,'זךרנםקזחטחפגךסמ',81,'תךזÿ‎ףם‏בא'),
(98,'צצנבגקבצממגשל',37,'ונכסםאגקתתנר',81,'üע‏üן‏טתדקגûנ'),
(99,'ץק‏פאאוû‏ק',89,'אלנשףרÿרפתחףו',76,'ûץכלמגחוץרישע‎'),
(100,'ךיףץבקקדךא',85,'יל‏לטןפטשמזט',61,'ûשגםמפףלסגאזÿטג'),
(101,'רמקכסכטדן‏ט',62,'‏חכצחמרךץ‏ע',45,'üפנ‏גüטךגםז'),
(102,'כחשזוובחסןפץ',23,'עכםפלכםתיחûודחפ',46,'תטקןךהטצמףי'),
(103,'ףÿסו‎מ‏ףשח',36,'ק‎זךףיאבÿפקקמס',55,'פףקקדחפףנüב'),
(104,'זÿםזביצףדיד',81,'ץטכתתדûךהנןש',21,'ןממחגןתקקÿ'),
(105,'לזטאס‏ךת‎',10,'טסהפ‏דר‏עףזקפ',44,'זשןככאקûא'),
(106,'אלנקûצדנ‏יקמפףע',67,'צאןנצצםפט‏ת‎üû',12,'ככבףםתרדבקףעןü'),
(107,'ץךüגנצבûלטר',24,'כנרמנלבעאט',96,'זתקטירחףשüגףטÿ'),
(108,'שץץםססüחעבץזר',56,'ףפסנבסט‏תüבאכג',29,'ûדגצעב‏שזצ'),
(109,'ךןזüüוÿדמ‎םק',91,'ûסףנאוטüפהûןû',96,'ü‏ץלאלאמצק'),
(110,'מûüךררםב‏לÿהיכ',24,'חצגאןü‎םץ',92,'פהאףסחותבחפû'),
(111,'üקענרההי‎ךת',60,'נגאקיג‎טובדלצ‎ט',89,'הט‏ךמץûיט'),
(112,'ביצף‏ןץדז',66,'לפרחףפצמבט',07,'גלםûנאפ‏בדנ'),
(113,'הסתגףףךןנ',00,'ןתדשץצטבÿ',97,'ומזשאשןשךüדזוא'),
(114,'קאם‏סץ‎‏בצ',20,'יבץץסרבשןג',64,'‏טתישüכי‎טדמ'),
(115,'ח‏ףפגעטחפÿתטלז',96,'‏חÿןוזחזפץזחצדü',85,'לזטוץüסךוס'),
(116,'תיטשםטבןונ‎',19,'דףûיג‏גÿרס',38,'ףטצצךחר‏מוÿו'),
(117,'ל‏חהףהדג‏',59,'וץבצצךגן‎וה',25,'‏זפםוהוקםתצט'),
(118,'ךץהץקדץיÿû',73,'נשדהצףנטהתח‎ר',13,'ûוףףחדû‎זירף‎'),
(119,'טןיתûםטנü‎üןפצ',30,'םךהעזüרÿכ',78,'ûהממהננףפ'),
(120,'קךלהעפצטüצ',52,'צכüכטזשךך‏שץלעמ',39,'כנג‏וםןחצ'),
(121,'ûעטהחינהא',47,'‎ודüךאךûחתלדכûז',75,'‏ההאזצםיÿכםי‎'),
(122,'קקךךנצםאע',88,'מךןחץץחםשין',25,'עטרבםדא‎ציז‏‏û‏'),
(123,'ףקףףטקסהש',71,'ךהצםנדיחעס',43,'אפ‎ועעךייג'),
(124,'ת‏חד‎ץזףÿ',16,'בהחדףך‏הÿקב‏',42,'ךקפגצםהÿרשד'),
(125,'דקקףרםפü‏רקדץל',76,'צרצאהב‎אחס',10,'מגןר‏שק‎שמאך‏'),
(126,'ש‏זûאנצץףרששדעם',69,'üךאםמדיר‎זנני',03,'םרעאע‎לüגÿ'),
(127,'ץאכקרצמ‎ûן',63,'זלקע‏לüספץון',05,'קזקûשעÿüךהץן'),
(128,'יחאנ‏טüשח‎כדהשא',08,'ןסכט‏הכ‏ÿ‎ןי‎ח',47,'‎כבטלכüמת'),
(129,'םלחדשטףûü‎אףנ',96,'ננפט‎‎ץקבג',72,'ל‏תשנאגפטה‎ש‎ץף'),
(130,'וטרףנü‏ר‏אי',89,'דחםרעוץרחאפל',34,'יסלרןזתהזלחאחיס'),
(131,'‏טדתןעשדקש',59,'צסזחצזךרסלץתüף',08,'עשףטמûכב‎בדא'),
(132,'קג‏üÿפכףד',08,'ךבפהךחףר‎ûכן',37,'רקזהשüברנתשק'),
(133,'לםתץלג‏גבנםםשאש',97,'סףמחםרןצלקÿÿב',59,'יûגואפתפץקע'),
(134,'ûצדנבצממה',86,'דקקמףûםחפםץףההü',73,'ף‏קלגסבי‏'),
(135,'ןי‏חדשךלפדץ',31,'םףסרנמןםגטצש',64,'ףחנקךיעץוÿדכז'),
(136,'ח‏פסםןש‏פס',59,'אהתהס‏נûה‎ד',91,'ÿתגלûשםשך'),
(137,'זןםצגתכש‏צ',04,'נגכÿטסקנתסתא‎ך',42,'ÿס‏בותטיצן'),
(138,'קבלבעוךמפ‏אטף‏',27,'אטחןשךÿשנךםÿןתע',90,'ילאאûינשף'),
(139,'מעס‏וצדנÿ‎ס‎ףמק',15,'רזצךסוûףםמן',79,'טתפÿג‎עפת'),
(140,'üצשלנתםםעה‏סגחא',59,'הר‏שפכÿכÿז‎',79,'טלחמ‏סגוחנת'),
(141,'גרפץÿלקןמ',07,'רךדקםיםו‎חטü',59,'סÿףסצûבגפנפןץס'),
(142,'וזטהקתטיצעהמגü‏',13,'גץלוףךנסזםץעמ',23,'ראדקרםףבדכ'),
(143,'רÿקרחק‏עספûזפי',32,'םצאבמחמפה',27,'דהגקצץקאטץכגה'),
(144,'םזבעיףצ‏ג',60,'אûףאכזםגשג',19,'םüהבבםףםםצםטז'),
(145,'ןו‏נצגףןÿצלטל',12,'ךיקüסתפצלםפנש',46,'עפילמüוÿגץפû'),
(146,'ûשןסלומו‏זחכץ',87,'ץת‎נץ‎מנץרכסס',70,'קץמצץאûטצüטû'),
(147,'ûףהפכ‏ןסאאוצפûפ',88,'ךד‎כבםןכגך',61,'אללעשלסקןüיץזב'),
(148,'עÿכüרךרמתûתח',65,'תךףûכעכדÿער',43,'מטחפבםהתעמאטייץ'),
(149,'דנûשמסצךףת',62,'‎אזצנףגÿשםתהטחץ',67,'חתכלרשץקדר'),
(150,'חüיע‏צוגדהגקÿ‏ח',36,'‏ץכלכץץן‎ןפו',58,'üבÿףגדוÿגסןגנ'),
(151,'ורחקבדנבףÿ',04,'קרüכשמהלחנש',70,'ץךÿצגשעüמ'),
(152,'םתגןנהןחח',32,'אתתגגין‏üסץןü',98,'בנלמףפצנסעםפ'),
(153,'ןצûעחךטלץל',95,'תחגאדעןישאüהז‏',31,'רםהחצצÿ‎זמûש'),
(154,'יןלרשץצטדנüם',43,'גה‏תשפךזטףטת',14,'‏מתנעלך‏ךשו'),
(155,'‎ÿצישדזלשגטית',67,'ךלצשבבזüץכû',45,'üטו‎רםלירך'),
(156,'רסילף‎ןפד',08,'‎ק‎üûצןרלע',92,'‎יתüבÿעוקסדû'),
(157,'‏בףתבטךפשנזב',93,'מקיÿמדלוכפûנ',88,'תן‏שדזזûנושרפז'),
(158,'לםשüץעסהיל‎סםג',62,'שחרדûתץםר',17,'כל‎בÿש‏חסןפת'),
(159,'ÿ‏ןבחןûÿךפ',50,'רחיגוחץתכחüקו',21,'תחנשגךקעכשץ‏ת'),
(160,'וקץנלÿא‎שתזזלûû',85,'אק‏ףחולבקה',54,'אזןץסטנÿטאףצח'),
(161,'מחציüלףךץףיז‎ü',33,'דונןÿסו‏ךןסםדעז',04,'ךצחגתחן‏ןןגד'),
(162,'קצהי‏‎שכןיûפנ',28,'üÿ‏ÿפשםרסדכ',12,'חהדףוüהץסדלהף'),
(163,'העהםיüÿנ‎ךûלü',80,'ססר‎ךגסמךנאפ‎ד',65,'וûצהןאזרבץ‎מען'),
(164,'עיאקףכניצצןזכ',39,'אץüגפÿזטןטדףנ‎',77,'דהקוץיפסןוגü'),
(165,'קרקךמשדצü‏יו',48,'אץכתומחךי',53,'גכןתועמÿכתהרתטס'),
(166,'ברןודץעערזןינ',93,'שטץכדבחבג',49,'פעחוהנוטמ‎ÿקדףץ'),
(167,'ןהחםתו‎שלם',99,'ÿףףלדכרץüאûטצû',94,'דץסקדץמךמכך‎אן'),
(168,'חחךידגמ‏דטותטם',49,'אע‎םרף‎‏נטדתנכ',04,'חץשצנומזנםת‎הכ'),
(169,'ץיתםםסמךל',48,'דבכםעעצממהףוגדז',47,'ךאטגסבךץכץי'),
(170,'ישÿקגûשפץ',22,'נןגזנארלךסדוךמר',50,'ןתזלמק‎תךף'),
(171,'ףכודפנבעד',19,'טמתם‏‏פהךזר‏כ',98,'עןרלפאדצ‎ףüףט'),
(172,'חללנךבשה‏ס',07,'תÿדעגלנכץףתףןע',63,'ץלץ‏זסûנזעןי‎י'),
(173,'גןש‎ûנףץûשÿ',01,'שעץעתקס‏שצ',82,'ןף‏וך‏הבסתו'),
(174,'üחםשםצ‏ל‏ז',46,'םûסהתשטזשן',59,'ודצופוךבקנחפ'),
(175,'ץיקÿבûתואכ',22,'üבקרûעûטפוהג',95,'ךףררûüן‏ךם'),
(176,'ומץכץאשפÿÿ',79,'קףג‏דק‏ססûלÿז',87,'בפזדהיףרנושמנü'),
(177,'השüהינחעןלזצ',50,'רצןרץזימהü',29,'םעתכטפץעמן‎ףההü'),
(178,'חלקקÿûאץקומ',33,'כ‎דםםזאעחץץך',80,'אומרקתÿנםצם‎אנה'),
(179,'עץכשיüלץû',70,'טתÿעטטם‎חמק',83,'חבדüדךףםלקןמ'),
(180,'מץקûזעעשתהנג',70,'זםהייךץתכים',96,'חם‎פךולגןנגת‎גק'),
(181,'קוץטשקüבÿעזעחכ',14,'אקמגלף‏חüאקתחענ',27,'לץסטמטלתמיבנם'),
(182,'ן‎ודףצוגÿüü',01,'ף‎‎ףא‏אץררננ',92,'לרהגקבקה‏‎י'),
(183,'‏ןבךüעאשס',13,'כטקחנ‏זגהפסב',83,'זףמדומרüשüפר'),
(184,'נת‎‏סומקבגעü‎חק',67,'צב‎ברשףאתתגבםשצ',82,'נרהיםרו‏גש'),
(185,'דךÿס‎ה‏סהצןו',79,'טמלקץנסטבזתייןת',50,'ד‎‏גןלץלאלהצד'),
(186,'נתתצ‏אש‏מ',03,'וקל‎נץרחור',84,'ûצאÿבמאמזח'),
(187,'זצףגע‎תûגÿב',61,'סזןחץ‎ÿקדע‏‏',72,'ת‎‏ףרזûץח'),
(188,'כזםבÿחרץבדקÿנץ',46,'ךקÿכיÿגצננש',10,'בצûךפחםלם'),
(189,'ךנםפצû‏עכףקזצûÿ',64,'ץמתדןהי‏בÿהכב',62,'יעכסüנחתםורר'),
(190,'שףÿגקכהןüקעעמפÿ',57,'‏שעûצנםטפיןרü',78,'זטקûחיחםל'),
(191,'‎זמüםûדזûמסגנ',17,'ם‏סץÿנגמפףףו',03,'ûפבגפןûנרצלךת'),
(192,'קבקזנ‏בגל',33,'תעךפעצהתםגח‏פןק',80,'ÿךץהשדרכמחזש‏'),
(193,'שלבחסצןקףצ‏ב',96,'אכצתסקתבכ‎ÿבףזה',70,'חףלר‎זץתובבקÿû'),
(194,'üשף‏וכקחטהוסץהנ',34,'זלןעןשךשרז',47,'נרûעתטÿוÿאב'),
(195,'זתגףקנדגמ',55,'מכשךקהפעתחג',58,'ÿעתם‏ü‎‎הזמü'),
(196,'סûןכתתזםא‎שאי',65,'ב‎ךסובקהÿüח',73,'חטשתט‏כוג‏גÿ'),
(197,'ל‎üÿדגץתÿחûחשע',11,'אדשוהפסאנר',00,'זכגץדרלטû'),
(198,'ןאסהז‎ףםשץעûץ',88,'שןû‏עךשרךתההü',26,'כקךקףטüתאü'),
(199,'פ‏‎קףססץמז',03,'ךפזלשוףדשצןז',14,'םפüאלך‎ס‎נ‏'),
(200,'אקבוÿככעקםם',34,'דטûמüןמüüנלא‏וק',16,'תכצמכץחןםÿתזשנח'),
(201,'‏כקיזגווûחךüךה',51,'לחהססןזקצצלûטך',97,'נהüםÿטביח‎'),
(202,'טצילאüמשוםÿ',78,'עאףפצךןעחרועא',99,'סקפ‏סעסüץכתחבהר'),
(203,'‏ףשםםוההûגעוצפ',90,'דמשאגזסאנשזץק',82,'שגüאלעםטדüגע'),
(204,'ûשנזאןאהזבר',32,'ג‏עלךüצךץיאצץגכ',15,'ץםלךנטצ‏ûץהנס'),
(205,'סאאותד‎ÿקדצ',35,'חץשצסûתקטכל',04,'םûûןיזהûנצÿדל'),
(206,'üטסüשûץנקכגףןבך',37,'ûשמעףצחצץ‏ה‏ü',86,'נזחכקשןומטםעק'),
(207,'גרץעסבצתןאס',29,'נערשןמתלזתגס',93,'זüוקכהלמוûת'),
(208,'אככררנס‏שק‎ûו',34,'צלûםובקטךןסלוך',50,'כÿקחדצפינתנÿ'),
(209,'גץ‎ןיאצםס‎‎ÿט',11,'כüאתטרםעטגסבםדג',36,'מפןכדט‎ÿל'),
(210,'תכ‎הלםסאמוס',52,'רעÿתץכזנס',69,'עüגפÿלםüהÿיכר'),
(211,'קה‎גפחטםק',90,'פüמחההלמטו‎שכןט',64,'üןםÿקפ‏םחק‎'),
(212,'ןÿטףלהדדר',38,'ןכüךסתפףחיק',50,'צל‏ûשנוםלü'),
(213,'דûשאעשü‎ךחצזךע',57,'‏זרעגךץ‏פכליח‏ן',88,'ךפףען‎פüנüלעםח'),
(214,'גןמלספכצפלת',25,'כעכאץןהלםכג',95,'ןשüאשץ‏üחגטו'),
(215,'ליהערגדקט‎פש‏ב',34,'העךךאכףסירצט',15,'צ‎ץףרüכשךץךûכ'),
(216,'שעüךמכךתףרל',48,'ןפןםנÿ‎מיאפû',01,'סüקÿלךעותÿ'),
(217,'ÿנמעשüüעשû',73,'כפקוהאפךדשינח',89,'ÿעערדÿאמדתבע‎ק'),
(218,'פףביחûהכושךא',66,'זוגכאהשחךנ',20,'בüףחףלר‎בךגס'),
(219,'ûצדנÿÿד‏לסום',91,'חבועןבבןטÿא',27,'דןץסזûןםנבףד'),
(220,'טûןûןûטגדגעחם',31,'ם‏םמםûדגןשü‏',48,'טסץÿקüץÿןההרמטת'),
(221,'חשנסםעךשעטץ',06,'םüטךדסךהüמפ',43,'‏יווץטüלזז'),
(222,'û‏םל‎ןפהםצרםןû',91,'ששףו‏קטסץבחזגעו',22,'הÿהטץםתזûÿפזע'),
(223,'וüנתרüכÿןלûחי',67,'י‎טגפזךדüתצכû',21,'בנûוע‎פצך'),
(224,'ÿרדסוûרר‎ןךצךצ',30,'תשצ‏üצü‎םץ',41,'ןûûÿקפû‎ד'),
(225,'םלםÿ‏נרץספצאÿûי',31,'יש‏הזמרוןןכ',04,'ÿגהיםרדלבב'),
(226,'ץ‏דו‏דפצדםךק',01,'סיûזלץûתר‎ÿצלכ',35,'‏דûסהרדדכהתךץ'),
(227,'ןזךץ‎ûעךתסד‎עתק',82,'גפךפדגןתשךüזראד',29,'אוüףלקגםפקûתך'),
(228,'ךûתקגלאבפט',41,'מץטהוקףת‏ק',39,'היüלףם‏ÿעג'),
(229,'û‏בההצ‎והןזלכ',99,'פגיםיךשויקכוית',50,'סגעט‏חאכרצüת'),
(230,'ûץûקויהמןüû‏אחא',63,'םבכזüרû‎ךרבû',11,'ב‏‎מÿעשףייס'),
(231,'םלתגהÿקזחחםאוי',75,'פתסגגüלצû',36,'ûצםÿץגü‏רשש'),
(232,'סדאÿנ‎טיןמךÿ',70,'צטÿדטתקקההת',09,'סםףגדבפטעףח'),
(233,'וקבעוזטאלבים',66,'אךטלüוךםדצ',69,'‏שפךטאןמÿע'),
(234,'כ‏כבüיץיע',31,'רÿרפûגיםיי',51,'ÿםעלעףבעÿלקנךû'),
(235,'אףףûתז‏סעס',70,'ûצ‏יףוספז',70,'צכפנחן‎פûלרךבול'),
(236,'ךרסכü‎ךדךסץמה',69,'ךןÿהחתüצü‎מסתץל',08,'דלץÿזממשזדע'),
(237,'דתובבפעה‏',60,'דץרצתהשמÿמלד',30,'וכתשטז‏מי'),
(238,'ינץםאוחגבדנ‎ט',68,'רךעלרשüםû',21,'וםןיכיפמת‏ןסת'),
(239,'כ‏פסלקערפ',59,'טףןףןעקךûÿ',85,'לאמןרךאמהןפודו'),
(240,'ססחפןז‎צבך‎',16,'עלאלüÿנברגגרג',31,'ראסףאלתםםסיה'),
(241,'‏דצטזüשץר',09,'סןגפנצדףכûפ',90,'סטמםחדונחךûח'),
(242,'פבןעןץ‎ים',15,'ÿהר‎ארüתץפ',16,'ךדחבףיפאגÿלטק'),
(243,'צץץםםדץנץץüג',38,'םכצצה‎פקיפבד',41,'‎ûנץךנ‎חוכ'),
(244,'הפלשוûקûפןתעלם',42,'לוך‎סûאפבלבףüס',68,'גÿשלÿפצ‏ןמן'),
(245,'זüדול‎ישüם',29,'ÿנגךכםאלךÿזלאדל',76,'ףףצפקכילÿז'),
(246,'נצףÿוÿ‎ערו',81,'סוהדÿסשûףÿ',82,'ךצליבב‎הלךûûף'),
(247,'ü‎üםדץףכÿבמ',24,'ע‎‏בנכףבפקיףאטש',60,'גססץנת‏ת‏'),
(248,'ך‏שףףשחכחסימטך‎',15,'חסטףנךתגןטםüטמ',70,'הכס‏לץןפקזה'),
(249,'שץûםתצטנמÿüיט',43,'ךû‎טאגםימגמ‏',89,'תÿזאפגטפך'),
(250,'טךואûף‏פאחגןאפ',83,'ץמגתחףחסרדעהאה',20,'כתישתפגקטשל'),
(251,'אס‏םםףגבפש‎ךגנף',04,'וההüüסגעכצגזנו',01,'‏גבעאה‎פÿתזüק‎ש'),
(252,'אקנüג‎צבכש‏',47,'פרןץפףםלûü',90,'יעלעסנלüס'),
(253,'ףטמÿפיûהûמ‎',10,'םנףû‏סעצב',84,'ו‎לךגסלנרשü'),
(254,'ף‎ןרעףצךטנבוג',90,'כמץאםן‏בר',97,'טגקשבענת‏צפüל'),
(255,'‏בנלכדנÿÿו',09,'יûחידוגןםןךזüכ',16,'איףקנזץהר'),
(256,'ד‏קÿריףנ‎‎שאל',29,'שזÿוףרםסחניף',62,'נטףךןסכטגףםך'),
(257,'פקזועאדגהסûרגע',67,'דנאקלסגüצבחץüב',11,'אררףÿקכטע'),
(258,'םחידגסנאקספדגףח',03,'זבכםשמףותלסדת',97,'אק‎‏ףקנכûרךטגה'),
(259,'ףביטסרנלÿ‏ך‎לתל',48,'‎ÿעבמךאםיü‏תל',33,'רעןחוךךסשקך'),
(260,'ששבדÿעץגלמתף',50,'קחמגרצססלצצלüאט',12,'סםאג‏נ‏תדÿ'),
(261,'גÿםבûבÿהךכ‏נ',32,'חטקובכאפמסךיüÿס',37,'אקÿנןךזüך‏'),
(262,'כפשתשלספאן‎ץס‏',93,'במלםכבתנאכזץץ',18,'קפüתןףיףהנ'),
(263,'םגשבסתטעויץת',69,'כ‎ץקומטחצףי',22,'ךץףכÿÿרםהמף'),
(264,'בשחךלןÿûנאפב',88,'םבקפעזפרףûוס',25,'רדûקטצרגטרס'),
(265,'ךאספףנאטûםג',33,'בעצפל‎ישאצחלזכן',77,'ןעתÿהדלמדזוארהצ'),
(266,'םמתקמפק‏ך',04,'üם‏מךÿןגמןנס',41,'‏דüהאÿשת‎מûטצתף'),
(267,'ÿצצûףונûוקüסתץס',51,'ÿעעפûףקעצ',12,'ץץûח‎üכזםדנטס'),
(268,'ןןףךמצפיכפüםמ',89,'ûאבבלץךךÿצ‎ס',45,'ןתךעûעמהנף'),
(269,'ונטזכיקח‏רü',31,'ץ‎ילÿגפûב',43,'חנקןעפ‏ומ'),
(270,'ץפהתפגסכשךקדר',02,'ףזמדךסקהפמנה',83,'ךףבךגםטץדכ'),
(271,'לןףךמûתצחנעטט',87,'צÿ‏גÿשםרעחןסמ',14,'ûכג‎שלעצצÿרו'),
(272,'בםמךלץûשüלבגסג',96,'יÿמ‎ל‎üפגכגצדע',24,'ÿץץüואûרודחןםה'),
(273,'ז‏למשףאûףÿף',48,'תוסןאאתטת‏רכ‏',10,'נüבג‎זףזלכ'),
(274,'שס‏ךתדךûטס',88,'סלץûשûצצעש',00,'לÿ‏חכצגהאצוק'),
(275,'אעסÿ‏ûלןצ‏',44,'חעûפקרךטה',18,'בפךחÿ‎בזףידף'),
(276,'עםהûףבדלר',21,'עזףÿןשü‏יזזנ‎ה',41,'ךÿףםןזתגנחללעב'),
(277,'ÿיכקכרטבכתûבאא',40,'ûכםה‎והעûצנצצממ',33,'ץקחהףגמםשל‏ûתךא'),
(278,'נÿÿיאךכצÿ‏',40,'ףדüÿûםשûקלובך',68,'מÿדהזüשצפטןבלרת'),
(279,'יכחאÿפמבנתךÿגÿ',28,'א‎עב‎‎ןקתך‏י',12,'עשü‎כגלמצגו'),
(280,'‎ףזüûםרברךÿסû',17,'ûנבןקצואחאת',36,'‎דבטÿטפםתתף'),
(281,'החטüוכלגזצ',80,'נûצגתךתûק',45,'להחלדûטקצז'),
(282,'ץךגבגשס‎ףץןכ',58,'üחדטראנףהץחצי‏ט',38,'וחץüבקצחרלישאףק'),
(283,'ןûגש‎יל‎כםץבהץ',25,'בט‎ץקÿמארצתהע',24,'קןלתמחמשיץיע'),
(284,'תםלתאל‎û‏',19,'ûףÿןצךדזוג',95,'מרנס‏ûי‏ףטשזעג'),
(285,'üראבאםרסכüüןם',45,'ץונלסחזפצûאז',47,'לאךטמםנקאש'),
(286,'ץתןץדטרüךהüםû',77,'üיüגאיפנץךיד',22,'טץןףגעתמתל'),
(287,'üקדצומגךüûיי‏ס',21,'מטו‏ףהצאערדÿט',95,'מו‎לכüסילןפ'),
(288,'צאפעתךכחככ',56,'ÿךעממדצשי‎טטסזל',45,'רזםסמןף‏טרנתשתמ'),
(289,'סף‎ûבבר‎אנ',91,'ננכצךא‏שפךחיה',35,'במקגאץקאמשח‎י'),
(290,'תפפתטלךÿד‎ע',52,'פתזרלזכמüÿÿת',52,'חûהיימבןבםץטא'),
(291,'גצןעמאןא‏ÿ',50,'ûרפעצזןקח',59,'יüüחץכקפמ'),
(292,'זבûÿטÿתקהזףגÿשכ',03,'תüחהÿז‏ÿעזן',84,'רûאעךןהדÿףןאםפי'),
(293,'üםכךץנקחüהחשÿ',88,'ןורממשוךיעק',29,'רןוגדזתשûח‎‏üל'),
(294,'ÿעוףזךû‎גופלךפר',91,'סןסיר‎ועם',62,'זיתמםםז‎ד'),
(295,'פםיםדלבואינד',86,'ח‏דגךףחסףד',33,'מûםûצדסקזי‏צףûפ'),
(296,'ד‏üÿלרןז‎םףץגם',62,'כאשננפןתסקפ',95,'חפ‏אמץרתז‎'),
(297,'פראÿטםףפו',11,'שאחמפזסûךט',50,'üדככסתא‏דוÿדם'),
(298,'אהÿמנינצזüץכש',26,'ןןנ‎שלנü‏רÿקפ‏',17,'הץבףלחמדשטרÿףםם'),
(299,'לףלךדךלףי',00,'דמש‏ןמםלךמקלסט',13,'דüשצלצזשטס')
GO